---
kind: type
id: T:Autodesk.Revit.DB.PointElementReference
source: html/f1548185-45ba-c1c6-8bde-4f9bb0669026.htm
---
# Autodesk.Revit.DB.PointElementReference

Base class for objects defining a way to
constrain a ReferencePoint to one or more other objects in a
document.

## Syntax (C#)
```csharp
public abstract class PointElementReference
```